{"config": [{"config": {"trainable": true, "name": "zeropadding2d_1", "input_dtype": "float32", "batch_input_shape": [1, 1, 50, 50], "padding": [2, 2]}, "class_name": "ZeroPadding2D"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "dim_ordering": "th", "subsample": [1, 1], "b_regularizer": null, "b_constraint": null, "W_constraint": null, "border_mode": "valid", "activity_regularizer": null, "nb_row": 5, "nb_col": 5, "trainable": true, "name": "conv1_1", "bias": true, "nb_filter": 8, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "zeropadding2d_2", "padding": [2, 2]}, "class_name": "ZeroPadding2D"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "dim_ordering": "th", "subsample": [1, 1], "b_regularizer": null, "b_constraint": null, "W_constraint": null, "border_mode": "valid", "activity_regularizer": null, "nb_row": 5, "nb_col": 5, "trainable": true, "name": "conv1_2", "bias": true, "nb_filter": 8, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "th", "trainable": true, "name": "maxpooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "zeropadding2d_3", "padding": [2, 2]}, "class_name": "ZeroPadding2D"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "dim_ordering": "th", "subsample": [1, 1], "b_regularizer": null, "b_constraint": null, "W_constraint": null, "border_mode": "valid", "activity_regularizer": null, "nb_row": 5, "nb_col": 5, "trainable": true, "name": "conv2_1", "bias": true, "nb_filter": 16, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "zeropadding2d_4", "padding": [2, 2]}, "class_name": "ZeroPadding2D"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "dim_ordering": "th", "subsample": [1, 1], "b_regularizer": null, "b_constraint": null, "W_constraint": null, "border_mode": "valid", "activity_regularizer": null, "nb_row": 5, "nb_col": 5, "trainable": true, "name": "conv2_2", "bias": true, "nb_filter": 16, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"pool_size": [5, 5], "border_mode": "valid", "strides": [5, 5], "dim_ordering": "th", "trainable": true, "name": "maxpooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "zeropadding2d_5", "padding": [2, 2]}, "class_name": "ZeroPadding2D"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "dim_ordering": "th", "subsample": [1, 1], "b_regularizer": null, "b_constraint": null, "W_constraint": null, "border_mode": "valid", "activity_regularizer": null, "nb_row": 5, "nb_col": 5, "trainable": true, "name": "conv3_1", "bias": true, "nb_filter": 40, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "zeropadding2d_6", "padding": [2, 2]}, "class_name": "ZeroPadding2D"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "dim_ordering": "th", "subsample": [1, 1], "b_regularizer": null, "b_constraint": null, "W_constraint": null, "border_mode": "valid", "activity_regularizer": null, "nb_row": 5, "nb_col": 5, "trainable": true, "name": "conv3_2", "bias": true, "nb_filter": 32, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.2}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "output_dim": 512, "activity_regularizer": null, "b_constraint": null, "trainable": true, "input_dim": null, "name": "dense_1", "bias": true, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "tanh"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.2}, "class_name": "Dropout"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "output_dim": 512, "activity_regularizer": null, "b_constraint": null, "trainable": true, "input_dim": null, "name": "dense_2", "bias": true, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_2", "activation": "tanh"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.15}, "class_name": "Dropout"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "output_dim": 512, "activity_regularizer": null, "b_constraint": null, "trainable": true, "input_dim": null, "name": "dense_3", "bias": true, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_3", "activation": "tanh"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_4", "p": 0.1}, "class_name": "Dropout"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "output_dim": 512, "activity_regularizer": null, "b_constraint": null, "trainable": true, "input_dim": null, "name": "dense_4", "bias": true, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_4", "activation": "tanh"}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "output_dim": 512, "activity_regularizer": null, "b_constraint": null, "trainable": true, "input_dim": null, "name": "dense_5", "bias": true, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_5", "activation": "tanh"}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "output_dim": 512, "activity_regularizer": null, "b_constraint": null, "trainable": true, "input_dim": null, "name": "dense_6", "bias": true, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_6", "activation": "tanh"}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "output_dim": 512, "activity_regularizer": null, "b_constraint": null, "trainable": true, "input_dim": null, "name": "dense_7", "bias": true, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_7", "activation": "tanh"}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "output_dim": 512, "activity_regularizer": null, "b_constraint": null, "trainable": true, "input_dim": null, "name": "dense_8", "bias": true, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_8", "activation": "tanh"}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "output_dim": 10, "activity_regularizer": null, "b_constraint": null, "trainable": true, "input_dim": null, "name": "dense_9", "bias": true, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_9", "activation": "sigmoid"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "1.0.6"}