{"keras_version": "1.0.6", "config": [{"config": {"batch_input_shape": [1, 1, 50, 50], "name": "zeropadding2d_1", "padding": [2, 2], "trainable": true, "input_dtype": "float32"}, "class_name": "ZeroPadding2D"}, {"config": {"nb_col": 5, "name": "conv1_1", "border_mode": "valid", "activity_regularizer": null, "nb_row": 5, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "nb_filter": 8, "dim_ordering": "th", "W_constraint": null, "subsample": [1, 1], "bias": true, "activation": "relu", "b_regularizer": null, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "zeropadding2d_2", "padding": [2, 2], "trainable": true}, "class_name": "ZeroPadding2D"}, {"config": {"nb_col": 5, "name": "conv1_2", "border_mode": "valid", "activity_regularizer": null, "nb_row": 5, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "nb_filter": 8, "dim_ordering": "th", "W_constraint": null, "subsample": [1, 1], "bias": true, "activation": "relu", "b_regularizer": null, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_1", "border_mode": "valid", "trainable": true, "strides": [2, 2], "dim_ordering": "th", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "zeropadding2d_3", "padding": [2, 2], "trainable": true}, "class_name": "ZeroPadding2D"}, {"config": {"nb_col": 5, "name": "conv2_1", "border_mode": "valid", "activity_regularizer": null, "nb_row": 5, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "nb_filter": 16, "dim_ordering": "th", "W_constraint": null, "subsample": [1, 1], "bias": true, "activation": "relu", "b_regularizer": null, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "zeropadding2d_4", "padding": [2, 2], "trainable": true}, "class_name": "ZeroPadding2D"}, {"config": {"nb_col": 5, "name": "conv2_2", "border_mode": "valid", "activity_regularizer": null, "nb_row": 5, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "nb_filter": 16, "dim_ordering": "th", "W_constraint": null, "subsample": [1, 1], "bias": true, "activation": "relu", "b_regularizer": null, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_2", "border_mode": "valid", "trainable": true, "strides": [5, 5], "dim_ordering": "th", "pool_size": [5, 5]}, "class_name": "MaxPooling2D"}, {"config": {"name": "zeropadding2d_5", "padding": [2, 2], "trainable": true}, "class_name": "ZeroPadding2D"}, {"config": {"nb_col": 5, "name": "conv3_1", "border_mode": "valid", "activity_regularizer": null, "nb_row": 5, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "nb_filter": 40, "dim_ordering": "th", "W_constraint": null, "subsample": [1, 1], "bias": true, "activation": "relu", "b_regularizer": null, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "zeropadding2d_6", "padding": [2, 2], "trainable": true}, "class_name": "ZeroPadding2D"}, {"config": {"nb_col": 5, "name": "conv3_2", "border_mode": "valid", "activity_regularizer": null, "nb_row": 5, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "nb_filter": 32, "dim_ordering": "th", "W_constraint": null, "subsample": [1, 1], "bias": true, "activation": "relu", "b_regularizer": null, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"p": 0.25, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "activity_regularizer": null, "input_dim": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "W_constraint": null, "trainable": true, "output_dim": 512, "bias": true, "activation": "linear", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "tanh", "trainable": true}, "class_name": "Activation"}, {"config": {"p": 0.25, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "activity_regularizer": null, "input_dim": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "W_constraint": null, "trainable": true, "output_dim": 512, "bias": true, "activation": "linear", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_2", "activation": "tanh", "trainable": true}, "class_name": "Activation"}, {"config": {"p": 0.25, "name": "dropout_3", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense_3", "activity_regularizer": null, "input_dim": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "W_constraint": null, "trainable": true, "output_dim": 512, "bias": true, "activation": "linear", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_3", "activation": "tanh", "trainable": true}, "class_name": "Activation"}, {"config": {"p": 0.25, "name": "dropout_4", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense_4", "activity_regularizer": null, "input_dim": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "W_constraint": null, "trainable": true, "output_dim": 512, "bias": true, "activation": "linear", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_4", "activation": "tanh", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dense_5", "activity_regularizer": null, "input_dim": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "W_constraint": null, "trainable": true, "output_dim": 512, "bias": true, "activation": "linear", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_5", "activation": "tanh", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dense_6", "activity_regularizer": null, "input_dim": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "W_constraint": null, "trainable": true, "output_dim": 512, "bias": true, "activation": "linear", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_6", "activation": "tanh", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dense_7", "activity_regularizer": null, "input_dim": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "W_constraint": null, "trainable": true, "output_dim": 512, "bias": true, "activation": "linear", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_7", "activation": "tanh", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dense_8", "activity_regularizer": null, "input_dim": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "W_constraint": null, "trainable": true, "output_dim": 512, "bias": true, "activation": "linear", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_8", "activation": "tanh", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dense_9", "activity_regularizer": null, "input_dim": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "W_constraint": null, "trainable": true, "output_dim": 5, "bias": true, "activation": "linear", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_9", "activation": "sigmoid", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential"}